'use client'
// @ts-nocheck
import React from 'react'
import * as ASSET from './asset'
import * as CONTRACT from './contract'
import * as GROUP from './group'
import * as MAINTENANCE from './maintenance'
import * as MATCHING from './matching'
import * as MEMBER from './member'
import NOTIFICATION_TYPE from './notification'
import * as POST from './post'
import * as SURVEY from './survey'
import * as TEMPLATE from './template'
import AGREE_OR_DISAGREE from './terms'
import MENU_SETUP from './menuSetup'
import Image from 'next/image'
import iconsErrorImg from '@/static/icons/icon-error.svg'

export {
  ASSET,
  CONTRACT,
  GROUP,
  MAINTENANCE,
  MATCHING,
  MEMBER,
  NOTIFICATION_TYPE,
  POST,
  SURVEY,
  TEMPLATE,
  AGREE_OR_DISAGREE,
  MENU_SETUP
}

export const CODE_NAME = {
  '00101': '개인',
  '00102': '사업자',
  '00201': '유효',
  '00202': '정지',
  '00203': '탈퇴',
  '00301': '남자',
  '00302': '여자',
  '00401': '회사',
  '00402': '부서',
  '00403': '업무',
  '00404': '프로젝트',
  '00405': '고객사',
  '00406': '거래처',
  '00501': '유효',
  '00502': '무효',
  '00503': '폐쇄',
  '05201': '서울',
  '05202': '경기',
  '05203': '인천',
  '05204': '강원',
  '05205': '충남',
  '05206': '대전',
  '05207': '충북',
  '05208': '세종',
  '05209': '부산',
  '05210': '울산',
  '05211': '대구',
  '05212': '경북',
  '05213': '경남',
  '05214': '전남',
  '05215': '광주',
  '05216': '전북',
  '05217': '제주',
  '00601': '유상',
  '00602': '무상',
  '00603': '폐기',
  '00604': '삭제',
  '00701': '유지보수',
  '00702': '프로젝트',
  '00703': '중계서비스',
  '00704': '유상서비스',
  '00705': '정기점검',
  '00801': '대기',
  '00802': '승인',
  '00803': '유효',
  '00804': '만료',
  '00901': '정기점검',
  '00902': '작업점검',
  '00903': '장애점검',
  '01007': '대기',
  '01008': '진행',
  '01010': '대기',
  '01011': '반려',
  '01012': '승인',
  '01015': '평가완료',
  '03301': '상',
  '03302': '중',
  '03303': '하',
  '01102': '일정변경',
  '01105': '점검등록',
  '01106': '완료전달',
  '01107': '작업시작',
  '01109': '작업종료',
  '01201': '요청',
  '01202': '반려',
  '01203': '승인',
  '01204': '작업',
  '01205': '수정',
  '01301': '대기',
  '01302': '진행',
  '01303': '완료',
  '01304': '등록',
  '01401': '승인담당자',
  '01402': '참조자',
  '01403': '점검담당자(정)',
  '01404': '점검담당자(부)',
  '01501': '그룹장',
  '01502': '그룹원',
  '01601': '유효',
  '01602': '무효',
  '01603': '탈퇴',
  '01604': '대기',
  '01605': '요청',
  '01701': '회사대표',
  '01702': '부서장',
  '01703': '부서원',
  '01704': '팀장',
  '01705': '팀원',
  '01706': '프로젝트담당자',
  '01707': '업무담당자',
  '01708': '통합유지보수관리자',
  '01709': '통합유지보수담당자',
  '01710': '유지보수담당자(정)',
  '01711': '유지보수담당자(부)',
  '01712': '유지보수관리자(승인담당자)',
  '01801': '상위그룹',
  '01802': '협력그룹',
  '03401': '유효',
  '03402': '무효',
  '01901': '계약체결자산',
  '01902': '체결이후추가자산',
  '02001': '유효',
  '02002': '무효',
  '02101': '그룹',
  '02102': '회원',
  '02201': '계약생성',
  '02202': '계약참조',
  '02203': '계약수행',
  '02204': '고객사',
  '02205': '거래처',
  '02206': '고객영업담당자',
  '02207': '거래처영업담당자',
  '02208': '자사영업대표',
  '02209': '계약관련영업담당자',
  '02301': '읽기',
  '02302': '쓰기',
  '02303': '수정',
  '02304': '삭제',
  '02401': '그룹',
  '02402': '회원',
  '02501': '권한상속자',
  '02502': '권한부여',
  '02601': '점검계획보고서',
  '02602': '점검완료보고서',
  '02603': '그룹공유문서',
  '02604': '기타',
  '02605': '서비스 공용',
  '02606': '계약서 양식',
  '02607': '계약서 공용',
  '02701': '정기점검',
  '02702': '작업점검',
  '02703': '장애점검',
  '02704': '해당없음',
  '02801': '유효',
  '02802': '삭제',
  '02901': '동의',
  '02902': '미동의',
  '03001': '계약',
  '03002': '전자결재',
  '03003': '실시간서비스보고내역',
  '03004': '서비스상세내역',
  '03005': '자산',
  '03006': '중계',
  '03007': '사업자회원로고',
  '03008': '사업자회원대표날인도장',
  '03009': '중계신청',
  '03010': '서비스요청',
  '03011': '회원프로필사진',
  '03012': '서비스완료보고싸인',
  '03013': '게시물',
  '03101': '성공',
  '03102': '실패',
  '03201': '유효',
  '03202': '삭제',
  '03501': '긴급장애',
  '03502': '일반장애',
  '03601': '그룹초대',
  '03602': '그룹수정',
  '03603': '그룹이동',
  '03604': '계약승인요청',
  '03605': '계약변경관리(계약수정)',
  '03606': '서비스요청(SR)',
  '03607': '서비스등록',
  '03608': 'Case Open',
  '03609': '권한변경',
  '03610': '권한요청',
  '03611': '중계신청',
  '03612': '중계신청결과',
  '03613': '공지사항',
  '03614': '형상관리공유',
  '03615': '서비스시작',
  '03616': '서비스완료',
  '03617': '유상서비스요청',
  '03618': '1:1문의사항',
  '03619': '설문등록',
  '03620': '쪽지수신',
  '03801': '요청',
  '03802': '공유',
  '03901': 'DBMS 구축',
  '03902': 'DBA',
  '03903': 'DA',
  '03904': 'DB튜닝',
  '03905': 'TA',
  '03906': 'SE',
  '03907': '프론트개발',
  '03908': '백엔드개발',
  '03909': '앱개발',
  '03910': 'PM/PL',
  '03911': '기타',
  '04001': '방문지원',
  '04002': '원격지원',
  '04003': '상주',
  '04004': '비상주',
  '04005': '기타',
  '04101': '특급',
  '04102': '고급',
  '04103': '중급',
  '04104': '초급',
  '04201': '진행',
  '04202': '마감',
  '04301': '신청완료',
  '04302': '선정',
  '04303': '미선정',
  '04401': '요청대기',
  '04402': '작업대기',
  '04403': '작업진행',
  '04404': '완료보고',
  '04405': '종결',
  '04406': '요청반려',
  '04501': '시스템 공지사항',
  '04502': '그룹 공지사항',
  '04503': '1:1문의사항',
  '04504': '자주하는질문',
  '04601': '대기',
  '04602': '처리중',
  '04603': '완료',
  '04701': '서비스관리',
  '04702': '그룹관리',
  '04703': '자산관리',
  '04704': '계약관리',
  '04705': '통계보고서관리',
  '04706': '설정관리',
  '04707': '회원가입',
  '04708': '중계관리',
  '04709': '고객센터',
  '04801': '서비스관리',
  '04802': '그룹관리',
  '04803': '자산관리',
  '04804': '계약관리',
  '04805': '통계보고서관리',
  '04806': '설정관리',
  '04807': '회원가입',
  '04808': '중계관리',
  '04809': '고객센터',
  '04901': 'H/W',
  '04902': 'S/W',
  '05001': '월',
  '05002': '분기',
  '05003': '반기',
  '05004': '년',
  '05005': '기타',
  '05101': '고객담당자',
  '05102': '영업담당자',
  '05103': '기술지원책임자',
  '05104': '기술지원부책임자',
  '05301': '유효',
  '05302': '마감',
  '05303': '삭제',
  '05401': '단답형',
  '05402': '장문형',
  '05403': '드롭다운형',
  '05404': '단일선택형',
  '05405': '복수선택형',
  '05406': '기타',
  '05501': '월',
  '05502': '분기',
  '05503': '반기',
  '05601': '회원관리',
  '05602': '자산관리',
  '05603': '계약관리',
  '05604': '설문조사',
  '05605': '월별통계',
  '05606': '자산통계',
  '05607': '엔지니어통계',
  '05608': '그룹별통계',
  '05609': '보고서',
  '05610': '요청관리(중계)',
  '05611': '계약관리(중계)',
  '05612': '그룹등록/조회',
  '05613': '그룹원조회',
  '05614': '유지보수관리',
  '05615': '서비스요청(SR)',
  '05616': '유상서비스',
  '05617': '정기정검조회',
  '05618': '스케줄(간편등록)',
  '05701': '요청',
  '05702': '승인',
  '05703': '반려',
  '05704': '수정완료',
  // '00000': 'ALL',
  '00000': '자산관리', // 자산통계
  '00001': '그룹관리',
  '00002': '권한관리',
  '00003': '계약관리',
  '00004': '자산관리',
  '00005': '서비스관리',
  '00006': '템플릿관리',
  '00007': '부서그룹관리',
  '00008': '게시물관리'
}

export const MONTHS = [
  { value: '01', label: '1월' },
  { value: '02', label: '2월' },
  { value: '03', label: '3월' },
  { value: '04', label: '4월' },
  { value: '05', label: '5월' },
  { value: '06', label: '6월' },
  { value: '07', label: '7월' },
  { value: '08', label: '8월' },
  { value: '09', label: '9월' },
  { value: '10', label: '10월' },
  { value: '11', label: '11월' },
  { value: '12', label: '12월' }
]

export const COLORS = [
  'rgb(255, 99, 132)',
  'rgb(255, 159, 64)',
  'rgb(255, 205, 86)',
  'rgb(75, 192, 192)',
  'rgb(54, 162, 235)',
  'rgb(153, 102, 255)',
  'rgb(201, 203, 207)'
]

export const COLORS_TRANSPARENT = [
  'rgb(255, 99, 132, 0.5)',
  'rgb(255, 159, 64, 0.5)',
  'rgb(255, 205, 86, 0.5)',
  'rgb(75, 192, 192, 0.5)',
  'rgb(54, 162, 235, 0.5)',
  'rgb(153, 102, 255, 0.5)',
  'rgb(201, 203, 207, 0.5)'
]

export const ERROR_TEXT = (
  <div>
    <Image alt="icon" src={iconsErrorImg} width={40} height={40} />
    <br />
    오류가 발생하였습니다.
    <br />
    관리자에게 문의 바랍니다.
  </div>
)

export const ASSET_DELETE_ERROR_TEXT = (
  <>
    <Image alt="icon" src={iconsErrorImg} width={40} height={40} />
    <br />
    <br />
    사용중인 자산으로 삭제가 불가능합니다.
  </>
)

export const PAID_DELETE_ERROR_TEXT = (
  <>
    <Image alt="icon" src={iconsErrorImg} width={40} height={40} />
    <br />
    <br />
    수락된 서비스 입니다. 삭제가 불가능합니다.
  </>
)

export const CONTRACT_DELETE_ERROR_TEXT = (
  <>
    <Image alt="icon" src={iconsErrorImg} width={40} height={40} />
    <br />
    <br />
    사용중인 계약으로 삭제가 불가능합니다.
  </>
)

export const ASSET_MANAGER_ERROR_TEXT = (
  <>
    <Image alt="icon" src={iconsErrorImg} width={40} height={40} />
    <br />
    <br />
    자산담당자는 최대 3명까지 가능합니다.
  </>
)
